In [1]:
import pandas as pd

In [2]:
dados = {
    'Nome': ['Alice', 'Bob', 'Charlie'],
    'Idade': [24, 30, 22],
    'Cidade': ['São Paulo', 'Rio de Janeiro', 'Belo Horizonte']
}

In [13]:
df = pd.DataFrame(dados)

In [4]:
df

      Nome  Idade          Cidade
0    Alice     24       São Paulo
1      Bob     30  Rio de Janeiro
2  Charlie     22  Belo Horizonte

In [ ]:
# Traz as 5 primeiras linhas se não passar valor
df.head(1)

    Nome  Idade     Cidade
0  Alice     24  São Paulo

In [ ]:
# Traz as 5 últiomas linhas se não passar valor
df.tail(2)

      Nome  Idade          Cidade
1      Bob     30  Rio de Janeiro
2  Charlie     22  Belo Horizonte

In [8]:
dados_notas = {
    'Nome':['Alice', 'Bob', 'Charlie', 'David', 'Eva'],
    'Matemática':[85, 90, 78, 88, 92],
    'Fisíca':[80, 75, 88, 85, 95],
    'Química':[78, 82, 85, 80, 88]
}

In [20]:
df_notas = pd.DataFrame(dados_notas)

In [15]:
df_notas

      Nome  Matemática  Fisíca  Química
0    Alice          85      80       78
1      Bob          90      75       82
2  Charlie          78      88       85
3    David          88      85       80
4      Eva          92      95       88

In [21]:
# Calculando a média das notas por aluno
df_notas['Média'] = df_notas[['Matemática', 'Fisíca', 'Química']].mean(axis=1)
df_notas

      Nome  Matemática  Fisíca  Química      Média
0    Alice          85      80       78  81.000000
1      Bob          90      75       82  82.333333
2  Charlie          78      88       85  83.666667
3    David          88      85       80  84.333333
4      Eva          92      95       88  91.666667

In [22]:
# Indentificar alunos aprovados com nota boa (média >= 82.5)
alunos_aprovados = df_notas[df_notas['Média'] >= 82.5]
alunos_aprovados

      Nome  Matemática  Fisíca  Química      Média
2  Charlie          78      88       85  83.666667
3    David          88      85       80  84.333333
4      Eva          92      95       88  91.666667

In [23]:
# Exibir a média e os alunos aprovados
df_notas[['Nome', 'Média']]

      Nome      Média
0    Alice  81.000000
1      Bob  82.333333
2  Charlie  83.666667
3    David  84.333333
4      Eva  91.666667

In [24]:
alunos_aprovados[['Nome', 'Média']]

      Nome      Média
2  Charlie  83.666667
3    David  84.333333
4      Eva  91.666667